{
  "basics": {
    "name": "Amanda Nitta",
    "label": "Student",
    "picture": "https://github.com/amandanitta.png",
    "email": "nittaak@hawaii.edu",
    "website": "https://amandanitta.github.io",
    "summary": "I am studying for a B.S. in Computer Science in the Department of Information and Computer Sciences at the University of Hawaii. I expect to graduate in Spring, 2024.",
    "location": { "address": "", "city": "Honolulu", "countryCode": "USA", "region": "Hawaii" },
    "profiles": [
      { "network": "github", "username": "amandanitta", "url": "http://github.com/amandanitta" },
      { "network": "linkedin", "username": "amandanitta", "url": "http://linkedin.com/in/amandanitta" }
    ]
  },
  "interests": [
    { "name": "Data Science" },
    { "name": "Cybersecurity" },
    { "name": "Data Visualization" },
    { "name": "Software Engineering" }
  ],
  "skills": [
    {
      "name": "Languages and Frameworks",
      "keywords": [ "C", "C++", "Java", "Javascript"]
    },
    {
      "name": "Toolsets/OS",
      "keywords": [ "MacOS", "Git/GitHub"]
    }
  ],
  "education": [
    {
      "institution": "University of Hawaii, Honolulu, HI",
      "area": "Computer Science (expected Spring, 2024)",
      "studyType": "B.S.",
      "startDate": "2020-09-01",
      "endDate": "Present",
      "courses": [
      ]
    }
  ],
  "work": [
    {
      "company": "Horizons: A Journal of Undergraduate Research, Creative Work, and innovation at the University of Hawaii at Manoa",
      "position": "Student Editorial Board",
      "website": "",
      "startDate": "2021-01",
      "endDate": "2022-05",
      "summary": "Reviewed and provided constructive criticism for ways to improve pieces before publication, along with providing an opinion to the editor about the viability of the piece",
      "highlights": [
        "Reviewed various pieces of different disciplines and provided feedback on whether it was universally readible",
        "Gained insight on the publication process", "Learned various writing conventions and how they can differ between different disciplines"
      ]
    },
    {
      "company": "University of Hawaii at Manoa",
      "position": "Learning Assistant",
      "website": "",
      "startDate": "2015-01-01",
      "endDate": "2016-03-15",
      "summary": "Teach and help students develop an understanding of Calculus 1 and 2 concets along with the application to real world scenarios. Facilitated assistance through helping in recitation sessions that help to bring a deeper understanding of materials presented in the lecture class along with hosting Office Hours (additional contact hours) using effective communication skills to present information clearly in a succint and easy-to-understand manner.",
      "highlights": [
        "Helped provide insight into calculus 1 and 2 concepts that helped to bring a further and deeper understanding of material"
      ]
    }
  ],
  "volunteer": [
    {
      "organization": "Hawaii United Okinawa Association",
      "website": "http://www.okinawanfestival.com/",
      "position": "WebApp developer",
      "startDate": "2016-01-01",
      "endDate": "Present",
      "summary": "The Okinawan Festival is the largest ethnic festival in the state of Hawaii. For the website the tasks were to gathere information from the various commitees so that the public is able to gain insight into what to expect from the festival. Along with helping to design pages to make them the most functional for attendees. The information gathered included parking infromation, admission, schedule of events, program, booths and etc",
      "highlights": [
        "Gained insight into how to present information in a readible format for the attendees",
        "Understanding the broader applications of putting information on the website."
      ]
    },
    {
      "organization": "",
      "website": "",
      "position": "Professional organization involvement",
      "startDate": "",
      "endDate": "",
      "summary": "",
      "highlights": [
        "Chair, ACM Manoa, 2016-Present",
        "Member, IEEE Student Branch, 2014-Present",
        "Webmaster/IT Officer, IEEE Student Branch, UH Manoa, 2012-2013"
      ]
    }
  ],
  "awards": [
    {
      "title": "Brandeis University Book Award",
      "date": "2019",
      "awarder": "Henry J. Kaiser High School",
      "summary": "Awarded to a Junior in the top 10% of their class and demonstrates a commitment to civic engagement, community service, political activism, social justice, or volunteer work."
    },
    {
      "title": "Second Degree Black Belt",
      "date": "2017",
      "awarder": "Grandmaster Hee Il Cho's Tae Kwon Do Center",
      "summary": "Awarded upon commpletion of testing for the second degree black belt. The testing process included demonstration of sets of different techniques followed by memory recitation of multiple passages that range from definition of patterns from white belt to black belt, along with describing morals and understanding of the role of a martial artist."
    }
  ],
  
  "publications": [ 
    { "name" : "An Exploration of the Way Modern Technology Can Influence the Development of Compassion in Adolescents",
     "type": "journal",
                   "publisher": "Horizons: A Journal of Undergraduate Research, Creative Work, and innovation at the University of Hawaii at Manoa", 
                    "release date": "2021-12-07",
                    "url": "https://scholarspace.manoa.hawaii.edu/server/api/core/bitstreams/64199b68-186c-4230-af7b-9ad44ea89daa/content", 
                     "summary": "Technology is becoming increasingly prevalent in society, where especially in recent times, virtually the majority of tasks, meetings, and schooling are carried out through online formats. This article aims to address the negative and positive effects that technology introduces and is increasingly prevalent in our society. These findings were analyzed through the analysis of literature. These studies are able to show how technology has brought about convenience but also has impacted the development of interpersonal and intrapersonal characteristics with particular emphasis on compassion and empathy. The studies analyzed were mainly based within the European Union, but can be further applied to other societies and the world."
                    
                    }], 
  "references": [
    {
      "name": "Available upon request"
    }
  ]
}
